# CannotAddToOptions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..CannotAddToOptions Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
Elements can't be added to Option Set
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAddToOptions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAddToOptions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAddToOptions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace